monoanddotnet/dotnet.html
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>dotnet fundamentals</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2008-11-19 18:33:25 IST"/>
<meta name="author" content="ggmon"/>
</head><body>
<h1 class="title">dotnet fundamentals</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Refreneces</a></li>
<li><a href="#sec-2">2 Dot Net Framework</a>
<ul>
<li><a href="#sec-2.1">2.1 Principle design features</a>
<ul>
<li><a href="#sec-2.1.1">2.1.1 Interoperability</a></li>
<li><a href="#sec-2.1.2">2.1.2 Common Runtime  Engine</a></li>
<li><a href="#sec-2.1.3">2.1.3 Base Class Library</a></li>
<li><a href="#sec-2.1.4">2.1.4 Simplified depolyment</a></li>
<li><a href="#sec-2.1.5">2.1.5 Scurity</a></li>
<li><a href="#sec-2.1.6">2.1.6 Portablity</a></li>
</ul>
</li>
<li><a href="#sec-2.2">2.2 Architecture</a>
<ul>
<li><a href="#sec-2.2.1">2.2.1 Common Language Infrastrucutue link</a></li>
<li><a href="#sec-2.2.2">2.2.2 Assemblies</a></li>
<li><a href="#sec-2.2.3">2.2.3 MetaData</a></li>
<li><a href="#sec-2.2.4">2.2.4 Security</a></li>
<li><a href="#sec-2.2.5">2.2.5 Class Library </a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">1 Refreneces</h2>
<div id="text-1">


<p>
<a href="http://en.wikipedia.org/wiki/.NET_Framework">http://en.wikipedia.org/wiki/.NET_Framework</a>
</p>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">2 Dot Net Framework</h2>
<div id="text-2">


<p>
Includes a large library of pre-coded solutions to common problems
written specifically for the framework.The pre-coded solutions that
form the framework's Base Class Library cover a large range of
programming needs in a number of areas, including user interface,
data access, database connectivity, cryptography, web application
development, numeric algorithms, and network communications. The
class library is used by programmers, who combine it with their own
code to produce applications.
</p>
<p>
The programs written for .NET framework execute in a software
environment that manages the program's runtime requirements. this
runtime environment is known as the Common Language Runtime
(CLR). The CLR provides the appearance of an application virtual
machine so that the programmers need not considet the capabilities
of the specific CPU tha will execute the program.
</p>
<p>
The CLR provides the important services such as security, memory
management and exception handling. The class Library and the CLR
together composes the .NET Framework.
</p>


</div>

<div id="outline-container-2.1" class="outline-3">
<h3 id="sec-2.1">2.1 Principle design features</h3>
<div id="text-2.1">



</div>

<div id="outline-container-2.1.1" class="outline-4">
<h4 id="sec-2.1.1">2.1.1 Interoperability</h4>
<div id="text-2.1.1">


</div>

</div>

<div id="outline-container-2.1.2" class="outline-4">
<h4 id="sec-2.1.2">2.1.2 Common Runtime  Engine</h4>
<div id="text-2.1.2">


</div>

</div>

<div id="outline-container-2.1.3" class="outline-4">
<h4 id="sec-2.1.3">2.1.3 Base Class Library</h4>
<div id="text-2.1.3">

<p>The Base Class Library (BCL), part of the Framework Class Library
(FCL), is a library of functionality available to all languages
using the .NET Framework. The BCL provides classes which
encapsulate a number of common functions, including file reading
and writing, graphic rendering, database interaction and XML
document manipulation.
</p>

</div>

</div>

<div id="outline-container-2.1.4" class="outline-4">
<h4 id="sec-2.1.4">2.1.4 Simplified depolyment</h4>
<div id="text-2.1.4">


</div>

</div>

<div id="outline-container-2.1.5" class="outline-4">
<h4 id="sec-2.1.5">2.1.5 Scurity</h4>
<div id="text-2.1.5">


</div>

</div>

<div id="outline-container-2.1.6" class="outline-4">
<h4 id="sec-2.1.6">2.1.6 Portablity</h4>
<div id="text-2.1.6">




</div>
</div>

</div>

<div id="outline-container-2.2" class="outline-3">
<h3 id="sec-2.2">2.2 Architecture</h3>
<div id="text-2.2">




</div>

<div id="outline-container-2.2.1" class="outline-4">
<h4 id="sec-2.2.1">2.2.1 Common Language Infrastrucutue <a href="cli.html">link</a></h4>
<div id="text-2.2.1">


<p>
The core aspects of the .NET framework lie within the Common
Language Infrastructure, or CLI. The purpose of the CLI is to
provide a language-neutral platform for application development
and execution, including functions for exception handling, garbage
collection, security, and interoperability. Microsoft's
implementation of the CLI is called the Common Language Runtime or
CLR.
</p>
</div>

</div>

<div id="outline-container-2.2.2" class="outline-4">
<h4 id="sec-2.2.2">2.2.2 Assemblies</h4>
<div id="text-2.2.2">


<p>
The Intermediate common intermediate language(CIL) code is housed
in .NET assemblies. As mandated by specification, assemblies are
stored in the Portable Executable(PE) format, common on windows
platforms for all DLL and EXE files. The assembly consits of one
or more files, one of which must contain the manifest, which has
the metadata for the assembly. The complete name of an assembly
contains its simple text name, version number, culture and public
key token. The public key is a unique hash which is generated when
the assembly is compiled.thus two assemblies with the same public
key token are guaranteed to be identical from the point of view of
the framework. A private key can also be specified known only to
the creator of the assembly and can be used for strong naming and
to guarantee that the assembly is from the same author.
</p>

</div>

</div>

<div id="outline-container-2.2.3" class="outline-4">
<h4 id="sec-2.2.3">2.2.3 MetaData</h4>
<div id="text-2.2.3">


<p>
ALL CLI is self-describing through .NET metadata. The CLR checks
the metadata to ensure that the correct method is called. Metadata
is usually generated by the language compilers, but developers can
develop their own metadata through custom attributes.Meta data
contain information about the assembly, and is also used for
reflective programming on .NET
</p>
</div>

</div>

<div id="outline-container-2.2.4" class="outline-4">
<h4 id="sec-2.2.4">2.2.4 Security</h4>
<div id="text-2.2.4">


<p>
.NET has its own security mechanism with two general features:
Code Access Security(CAS), and validation and verification.
</p>

</div>

</div>

<div id="outline-container-2.2.5" class="outline-4">
<h4 id="sec-2.2.5">2.2.5 Class Library </h4>
<div id="text-2.2.5">
















</div>
</div>
</div>
</div>
<div id="postamble"><p class="author"> Author: ggmon
<a href="mailto:ggmon@staging.songbirdtech.com">&lt;ggmon@staging.songbirdtech.com&gt;</a>
</p>
<p class="date"> Date: 2008-11-19 18:33:25 IST</p>
<p>HTML generated by org-mode 6.06b in emacs 22<p>
</div></body>
</html>
